raw = '''
0 New Research 0 (未使用)(盖亚)
1 答剌罕骑兵 (激活)(匈)
2 精锐答剌罕骑兵 (匈)
3 菁英侍卫 (不列颠)
4 黄金国 (玛)
5 凯尔特狂热 (凯)
6 操练 (蒙)
7 象夫 (波)
8 城镇瞭望
9 狂热 (萨)
10 火炮术 (土)
11 垛口 (条)
12 轮作
13 重犁
14 马轭
15 行会
16 无政府状态 (哥)
17 银行业
18 兵营近卫军 (哥)
19 制图学
20 货币 (未使用)
21 无神论 (匈)
22 织布机
23 铸币术
24 荣冠战争 (阿兹)
25 马厩 (激活)
26 羽箭手 (激活)(玛)
27 精锐羽箭手 (玛)
28 罗盘 (未使用)
29 赎罪 +5 僧侣 HP (阿兹)
30 圣洁 +5 僧侣 HP (阿兹)
31 热忱 +5 僧侣 HP (阿兹)
32 救赎 +5 僧侣 HP (阿兹)
33 信念 +5 僧侣 HP (阿兹)
34 战舰
35 大型战舰
36 启蒙 +5 僧侣 HP (阿兹)
37 炮舰
38 雕版印刷术 +5 僧侣 HP (阿兹)
39 畜牧
40 异端邪说 +5 僧侣 HP (阿兹)
41 神权政治 +5 僧侣 HP (阿兹)
42 步兵 +1 攻击 (未使用)(阿兹)
43 步兵 +2 攻击 (未使用)(阿兹)
44 步兵 +3 攻击 (未使用)(阿兹)
45 信念
46 雕版印刷术 (未使用)
47 化学
48 大篷车
49 狂战士之怒 (维)
50 石匠
51 建筑学
52 火箭学 (中)
53 弓兵 -20% 花费 (玛)
54 踏旋起重机
55 采金法
56 弓兵 -30% 花费 (玛)
57 西班牙炮舰 (未使用)
58 征服者 (激活)(西)
59 投石器 (日)
60 精锐征服者 (西)
61 后勤学 (拜)
62 New Research 62 (未使用)(盖亚)
63 大型箭塔
64 炮塔
65 捕鱼刺网
66 New Research 66 (未使用)(盖亚)
67 锻造
68 铸铁
69 村民+30 对动物攻击 (马扎尔)
70 起始鹰勇士 (未使用)(印加)
71 石墙/城门 x2 HP
72 垛墙/城门 x2 HP (未使用)
73 New Research 73 (未使用)(盖亚)
74 步兵鳞甲
75 鼓风高炉
76 步兵锁甲
77 步兵板甲
78 New Research 78 (未使用)(盖亚)
79 New Research 79 (未使用)(盖亚)
80 骑兵板甲
81 骑兵鳞甲
82 骑兵锁甲
83 芒刺斧 (法)
84 传教士 (激活)(西)
85 火枪手 (激活)
86 New Research 86 (未使用)(盖亚)
87 长矛兵 (激活)
88 New Research 88 (未使用)(盖亚)
89 New Research 89 (未使用)(盖亚)
90 追踪术
91 New Research 91 (未使用)(盖亚)
92 New Research 92 (未使用)(盖亚)
93 弹道学
94 弩炮 (激活)
95 免费翼骑兵 (未使用)(土)
96 中型冲车
97 New Research 97 (未使用)(盖亚)
98 精锐掷矛手
99 掷矛手 (激活)
100 弩手
101 封建时代
102 城堡时代
103 帝王时代
104 黑暗时代
105 New Research 105 (未使用)(盖亚)
106 阴影 铁匠铺 黑暗时代 (未使用)
107 阴影 修道院 黑暗时代 (未使用)
108 阴影 船坞 黑暗时代 (未使用)
109 阴影 农田 黑暗时代 (未使用)
110 阴影 磨坊 黑暗时代 (未使用)
111 骆驼兵 (隐藏科技)
112 渔船 (未使用)
113 New Research 113 (未使用)(盖亚)
114 长矛兵 (未使用)
115 New Research 115 (未使用)(盖亚)
116 村民 (未使用)
117 木墙 (未使用)
118 阴影 城镇中心 黑暗时代 (未使用)
119 New Research 119 (未使用)(盖亚)
120 阴影 Node Age 2 (未使用)
121 New Research 121 (未使用)(盖亚)
122 阴影 兵营 封建时代 (未使用)
123 阴影 铁匠铺 封建时代 (未使用)
124 阴影 修道院 封建时代 (未使用)
125 阴影 船坞 封建时代 (未使用)
126 阴影 农田 封建时代 (未使用)
127 瞭望箭塔 (激活)
128 阴影 市场 封建时代 (未使用)
129 阴影 磨坊 封建时代 (未使用)
130 阴影 马厩 封建时代 (未使用)
131 阴影 贸易工厂 封建时代 (未使用)
132 阴影 靶场 封建时代 (未使用)
133 New Research 133 (未使用)(盖亚)
134 升级兵营至靶场 (未使用)
135 阴影 Node 城堡时代 (未使用)
136 New Research 136 (未使用)(盖亚)
137 城堡 (激活)
138 阴影 攻城武器厂 城堡时代 (未使用)
139 New Research 139 (未使用)(盖亚)
140 警戒箭塔
141 New Research 141 (未使用)(盖亚)
142 阴影 Node 帝王时代 (未使用)
143 阴影 塔 帝王时代 (未使用)
144 奇观 (激活)
145 New Research 145 (未使用)(盖亚)
146 阴影 大学 城堡时代 (未使用)
147 靶场 (激活)
148 市场 (激活)
149 攻城武器厂 (激活)
150 大学 (激活)
151 步弓手 (激活)
152 New Research 152 (未使用)(盖亚)
153 New Research 153 (未使用)(盖亚)
154 New Research 154 (未使用)(盖亚)
155 New Research 155 (未使用)(盖亚)
156 轻装骆驼兵 (未使用)
157 僧侣 (激活)
158 长矛兵 (未使用)
159 New Research 159 (未使用)(盖亚)
160 剑士 (未使用)
161 贸易车 (激活)
162 轻型冲车 (激活)
163 New Research 163 (未使用)(盖亚)
164 New Research 164 (未使用)(盖亚)
165 New Research 165 (未使用)(盖亚)
166 骑士 (激活)
167 New Research 167 (未使用)(盖亚)
168 New Research 168 (未使用)(盖亚)
169 New Research 169 (未使用)(盖亚)
170 New Research 170 (未使用)(盖亚)
171 New Research 171 (未使用)(盖亚)
172 手推炮 (未使用)
173 New Research 173 (未使用)(盖亚)
174 火枪手 (未使用)
175 重装骑士 (未使用)
176 New Research 176 (未使用)(盖亚)
177 New Research 177 (未使用)(盖亚)
178 所有时代 (未使用)
179 New Research 179 (未使用)(盖亚)
180 贸易船 (激活)
181 New Research 181 (未使用)(盖亚)
182 钻井采金术
183 New Research 183 (未使用)(盖亚)
184 New Research 184 (未使用)(盖亚)
185 New Research 185 (未使用)(盖亚)
186 长剑士 (隐藏科技)
187 城镇中心 (激活)
188 手推炮 (激活)
189 石墙 / 城门 (激活)
190 New Research 190 (未使用)(盖亚)
191 New Research 191 (未使用)(盖亚)
192 骑射手 (激活)
193 New Research 193 (未使用)(盖亚)
194 垛墙
195 New Research 195 (未使用)(盖亚)
196 New Research 196 (未使用)(盖亚)
197 长枪兵
198 New Research 198 (未使用)(盖亚)
199 箭羽
200 锥箭簇
201 护腕
202 双刃斧
203 弓形锯
204 斥候骑兵 (激活)
205 New Research 205 (未使用)(盖亚)
206 New Research 206 (未使用)(盖亚)
207 长剑士
208 New Research 208 (未使用)(盖亚)
209 重装骑士
210 修道院 (激活)
211 弓兵软甲
212 弓兵皮甲
213 独轮手推车
214 New Research 214 (未使用)(盖亚)
215 护卫
216 农田 (激活)
217 双手剑士
218 重装骑射手
219 弓兵环甲
220 兵营 (激活)
221 双人锯
222 剑士
223 New Research 223 (未使用)(盖亚)
224 New Research 224 (未使用)(盖亚)
225 New Research 225 (未使用)(盖亚)
226 New Research 226 (未使用)(盖亚)
227 New Research 227 (未使用)(盖亚)
228 New Research 228 (未使用)(盖亚)
229 New Research 229 (未使用)(盖亚)
230 雕版印刷术
231 圣洁
232 New Research 232 (未使用)(盖亚)
233 启蒙
234 启用转化 (隐藏科技)
235 骆驼兵 (激活)
236 重装骆驼兵
237 劲弩手
238 New Research 238 (未使用)(盖亚)
239 重型弩炮
240 箭船 (激活)
241 New Research 241 (未使用)(盖亚)
242 爆破船 (激活)
243 喷火船 (激活)
244 重型爆破船
245 New Research 245 (未使用)(盖亚)
246 快速喷火船
247 New Research 247 (未使用)(盖亚)
248 New Research 248 (未使用)(盖亚)
249 二轮手推车
250 New Research 250 (未使用)(盖亚)
251 New Research 251 (未使用)(盖亚)
252 热情
253 New Research 253 (未使用)(盖亚)
254 轻骑兵
255 重装冲车
256 巨型投石机 组装的 (激活)
257 中型投石车
258 阴影 锯木场 1 (未使用)
259 New Research 259 (未使用)(盖亚)
260 New Research 260 (未使用)(盖亚)
261 运输船 (激活)
262 日本武士 (激活)(日)
263 长弓兵 (激活)(不列颠)
264 冠军剑士
265 游侠
266 已建造城堡 (未使用)
267 甲胄骑兵 (激活)(拜)
268 诸葛弩 (激活)(中)
269 马穆鲁克 (激活)(萨)
270 狂战士 (未使用)(哥)
271 苏丹亲兵 (激活)(土)
272 龙头战舰 (激活)(维)
273 蒙古突骑 (激活)(蒙)
274 战象 (激活)(波)
275 掷斧兵 (激活)(法)
276 条顿武士 (激活)(条)
277 菘蓝突击者 (激活)(凯)
278 采石法
279 钻井采石术
280 城镇巡逻
281 铁匠铺 (激活)
282 采矿场已建造 (未使用)
283 建筑 +10% HP (拜)
284 垃圾单位花费 -25% (拜)
285 免费 化学 (未使用)(土)
286 炮舰 +25% HP (土)
287 免费 马轭 (未使用)(法)
288 免费 重犁 (未使用)(法)
289 免费 轮作 (未使用)(法)
290 骑士 +20% HP (法)
291 步兵花费 -50% (隐藏科技)
292 New Research 292 (未使用)(盖亚)
293 渔船 贸易船 +20% 移动速度 (隐藏科技)
294 单位 2 转化抵抗力 (隐藏科技)
295 阴影 攻城武器厂 封建时代 (未使用)(库)
296 New Research 296 (未使用)(盖亚)
297 New Research 297 (未使用)(盖亚)
298 New Research 298 (未使用)(盖亚)
299 New Research 299 (未使用)(盖亚)
300 金矿工 +15% 工作速度 (土)
301 火药单位 +25% HP (土)
302 起始6村民 (中)
303 New Research 303 (未使用)(盖亚)
304 科技花费 -0% (中)
305 New Research 305 (未使用)(盖亚)
306 渔船 X2 HP +5% 工作速度 +2 远程护甲 (日)
307 New Research 307 (未使用)(盖亚)
308 New Research 308 (未使用)(盖亚)
309 New Research 309 (未使用)(盖亚)
310 New Research 310 (未使用)(盖亚)
311 New Research 311 (未使用)(盖亚)
312 骑射手+4 对建筑攻击  (萨)
313 索洛托勇士 (禁用)
314 农田花费 -33% (条)
315 征募
316 救赎
317 围板 (隐藏科技)
318 索洛托勇士 (激活)(阿兹)
319 赎罪
320 重型投石车
321 工兵
322 射击孔
323 New Research 323 (未使用)(盖亚)
324 New Research 324 (未使用)(盖亚)
325 城堡花费 -25% (法)
326 New Research 326 (未使用)(盖亚)
327 步兵+1 对建筑攻击 (哥)
328 New Research 328 (未使用)(盖亚)
329 New Research 329 (未使用)(盖亚)
330 New Research 330 (未使用)(盖亚)
331 房屋花费 建造时间 1/3 (未使用)(哥)
332 哨站 (激活)
333 塔 +4 最大箭矢数 (未使用)(条)
334 New Research 334 (未使用)(盖亚)
335 New Research 335 (未使用)(盖亚)
336 城镇中心 +10 驻扎量 (条)
337 运输船 x2 HP x2 载量 (萨)
338 弓兵 87% 准确度 (隐藏科技)
339 箭船 x2 视野 (未使用)(日)
340 磨坊 伐木场/采矿场花费 -50% (日)
341 步兵 +25% 攻击速度 (日)
342 城镇中心 x2 HP (波)
343 步兵花费 -0% (哥)
344 步兵花费 -25% (哥)
345 步兵花费 -35% (未使用)(哥)
346 步兵花费 -50% (未使用)(哥)
347 僧侣 8 治疗范围 (条)
348 索洛托勇士 (激活)(玛)
349 船坞 x2 HP (波)
350 科技花费 -10% (中)
351 科技花费 -15% (中)
352 科技花费 -20% (中)
353 塔 +5 驻扎量 +4 最大箭矢数 (条)
354 城堡 (激活)(土)
355 市场 税率 5% 花费 -75 木材 (萨)
356 科技花费 -50% (未使用)
357 渔网 (激活)
358 轻型投石车 (激活)
359 副-阴影 帝王时代 (未使用)
360 精锐长弓兵 (不列颠)
361 精锐甲胄骑兵 (拜)
362 精锐诸葛弩 (中)
363 精锐掷斧兵 (法)
364 精锐条顿武士 (条)
365 精锐近卫军 (哥)
366 精锐日本武士 (日)
367 精锐战象 (波)
368 精锐马穆鲁克 (萨)
369 精锐苏丹亲兵 (土)
370 精锐菘蓝突击者 (凯)
371 精锐蒙古突骑 (蒙)
372 精锐龙头战舰 (维)
373 船匠
374 修船厂
375 干船坞
376 精锐炮舰
377 攻城技师
378 索洛托勇士 (激活)(印加)
379 围板
380 加热射击
381 城镇中心花费 -50% 木材 (不列颠)
382 徒步弓兵 +1 射程 (不列颠)
383 牧羊人 +25% 工作速度 (不列颠)
384 鹰勇士
385 伐木工 +15% 工作速度 (凯)
386 攻城武器 +20% 攻击速度 (凯)
387 鹰斥候额外 攻击 (印加)
388 轻骑兵 翼骑兵 +30% HP (蒙)
389 猎人 +50% 工作速度 (蒙)
390 防御工事 建造快 25% (高丽)
391 步兵 +20% HP (维)
392 免费独轮手推车 (未使用)(维)
393 步兵 +15% 移动速度 (凯)
394 骑射手 +20% 攻击速度 (蒙)
395 舰船便宜 10% (维)
396 爆破船 +50% HP (中)
397 喷火船 +20% 攻击速度 (拜)
398 精锐狂战士 (维)
399 狂战士 (激活)(维)
400 免费 二轮手推车 (未使用)(维)
401 农夫 +15% 工作速度 (未使用)(拜)
402 猎人 +5 对野猪攻击  载量 +15 (哥)
403 徒步弓兵 +1 射程 (不列颠)
404 箭船 +20% 攻击速度 (萨)
405 绵羊转化抵抗力 (凯)
406 额外人口 +10 (哥)
407 僧侣 4 治疗范围 (隐藏科技)
408 间谍/叛国者
409 城镇中心 +10%/+15%/+20% 工作速度 (波)
410 城镇中心 +15% 工作速度 (未使用)(波)
411 城镇中心 +20% 工作速度 (未使用)(波)
412 船坞 +10/+15%/+20% 工作速度 (波)
413 船坞 +15% 工作速度 (未使用)(波)
414 船坞 +20% 工作速度 (未使用)(波)
415 步兵 +15% HP (维)
416 步兵 +10% HP (维)
417 建筑 +20% HP (拜)
418 建筑 +30% HP (拜)
419 建筑 +40% HP (拜)
420 步兵 +15% 攻击速度 (未使用)(日)
421 步兵 +20% 攻击速度 (未使用)(日)
422 渔船 +10% 工作速度 (日)
423 渔船 +15% 工作速度 (日)
424 渔船 +20% 工作速度 (日)
425 城镇中心 +5 人口 (中)
426 爆破兵 (激活)
427 Genitour (激活)
428 翼骑兵
429 长戟兵
430 精锐 Genitour
431 豹勇士 (激活)(阿兹)
432 精锐豹勇士 (阿兹)
433 鹰斥候 (激活)
434 精锐鹰勇士
435 血统
436 帕提亚战术
437 扳指
438 神权政治
439 异端邪说
440 霸权 (西)
441 草药学
442 免费 警戒箭塔 (高丽)
443 免费 大型箭塔 (高丽)
444 免费 炮塔 (高丽)
445 神机箭 (高丽)
446 近卫军 (激活)(哥)
447 龟甲船 (激活)(高丽)
448 精锐龟甲船 (高丽)
449 战车 (激活)(高丽)
450 精锐战车 (高丽)
451 塔 +1 射程 1 (未使用)(高丽)
452 塔 +1 射程 2 (高丽)
453 塔 +1 射程 3 (高丽)
454 New Research 454 (未使用)(盖亚)
455 New Research 455 (未使用)(盖亚)
456 草药学 +5 僧侣 HP (阿兹)
457 井喷 (哥)
458 骑射手花费 -10% (匈)
459 骑射手花费 -20% (匈)
460 掷矛器 (阿兹)
461 战狼号 (不列颠)
462 长城 (中)
463 酋长 (维)
464 希腊之火 (拜)
465 制图学 (未使用)
466 免费 战舰 (意)
467 热那亚弩手 (激活)(意)
468 精锐热那亚弩手 (意)
469 New Research 469 (未使用)(盖亚)
470 已建造奇观 (未使用)(盖亚)
471 马扎尔骠骑 (激活)(马扎尔)
472 精锐马扎尔骠骑 (马扎尔)
473 侦察兵便宜 15% (马扎尔)
474 村民 锻造 (印加)
475 村民 铸铁 (印加)
476 村民 鼓风高炉 (印加)
477 村民 鳞甲 (印加)
478 村民 锁甲 (印加)
479 村民 板甲 (印加)
480 骑象射手 (激活)(印度)
481 精锐骑象射手 (印度)
482 堡垒 (凯)
483 掠夺者 (匈)
484 射箭孔 (日)
485 黑曜石之箭 (玛)
486 板屋船 (高丽)
487 游牧 (蒙)
488 波斯步弓手 (波)
489 重装甲 (条)
490 清真学堂 (萨)
491 突厥骑射 (土)
492 宗教法庭 (西)
493 骑士精神 (法)
494 大盾 (意)
495 房屋 +5 人口 (印加)
496 村民花费 -10% (印度)
497 村民花费 -20% (印度)
498 村民花费 -30% (印度)
499 丝绸之路 (意)
500 火药单位便宜 15% (意)
501 舰船便宜 15% (维)
502 舰船便宜 20% (维)
503 贵族铁骑 (激活)(斯)
504 精锐贵族铁骑 (斯)
505 骆驼兵 +1 远程护甲 (印度)
506 苏丹王 (印度)
507 印度火铳 (印度)
508 印加枪兵长 (激活)(印加)
509 精锐印加枪兵长 (印加)
510 攻城塔 (激活)(未使用)
511 攻城武器便宜 15% (斯)
512 东正教 (斯)
513 皇家卫队 (斯)
514 意大利佣兵 (马扎尔)
515 反曲弓 (马扎尔)
516 安第斯弹弓 (印加)
517 信使 (印加)
518 渔夫载量 +25 (印度)
519 建筑花费 -20% 石料 (印加)
520 弓兵 HP (未使用)(马扎尔)
521 帝王骆驼兵 (印度)
522 意大利佣兵 (激活)
523 木城门 (激活)
524 采集者 +25% 工作速度 (法)
525 堑壕 (隐藏科技)
526 猎犬
527 喷火塔 (激活)(隐藏科技)
528 投石手 (激活)(印加)
529 Civ: 不列颠 (不列颠)
530 Civ: 法兰克 (法)
531 Civ: 哥特 (哥)
532 Civ: 条顿 (条)
533 Civ: 日本 (日)
534 Civ: 中国 (中)
535 Civ: 拜占庭 (拜)
536 Civ: 波斯 (波)
537 Civ: 萨拉森 (萨)
538 Civ: 土耳其 (土)
539 Civ: 维京 (维)
540 Civ: 蒙古 (蒙)
541 Civ: 凯尔特 (凯)
542 Civ: 西班牙 (西)
543 Civ: 阿兹特克 (阿兹)
544 Civ: 玛雅 (玛)
545 Civ: 匈族 (匈)
546 Civ: 高丽 (高丽)
547 Civ: 意大利 (意)
548 Civ: 印度 (印度)
549 Civ: 印加 (印加)
550 Civ: 马扎尔 (马扎尔)
551 Civ: 斯拉夫 (斯)
552 猎犬 (蒙)
553 村民花费 -25% (印度)
554 起始 4 村民 (玛)
555 启用绵羊
556 启用羊驼
557 启用奶牛
558 启用火鸡
559 所有单位花费 -15% 黄金 (葡)
560 舰船 +10% HP (葡)
561 大学研究速度 +80% (马里)
562 风琴炮 (激活) (葡)
563 精锐风琴炮 (葡)
564 骆驼射手 (激活) (柏)
565 精锐骆驼射手 (柏)
566 飞刀女兵 (激活) (马里)
567 精锐飞刀女兵 (马里)
568 弯刀勇士 (激活) (埃塞)
569 精锐弯刀勇士 (埃塞)
570 大商站 (激活)
571 <571>
572 巨桅大帆船 (葡)
573 火绳枪 (葡)
574 龙脉 (埃塞)
575 扭绞机 (埃塞)
576 蛮王 (马里)
577 死士 (马里)
578 土堡 (柏)
579 马格里布骆驼 (柏)
580 Civ: 葡萄牙 (葡)
581 Civ: 埃塞俄比亚 (埃塞)
582 Civ: 马里 (马里)
583 Civ: 柏柏尔 (柏)
584 村民移动速度 +10% (柏)
585 舰船移动速度 +10% (柏)
586 马厩单位花费 -15%, 城堡时代 (柏)
587 +100 黄金/食物, 封建时代 (埃塞)
588 +100 黄金/食物, 城堡时代 (埃塞)
589 +100 黄金/食物, 帝王时代 (埃塞)
590 免费长枪兵系升级 (埃塞)
591 步兵 +1 远程护甲 封建时代 (马里)
592 步兵 +1 远程护甲 城堡时代 (马里)
593 步兵 +1 远程护甲 帝王时代 (马里)
594 免费采金术升级 (马里)
595 建筑花费 -25% 木材 (马里)
596 卡拉维尔战舰 (激活) (葡)
597 精锐卡拉维尔战舰 (葡)
598 标枪骑兵 (激活) (未使用) (柏)
599 精锐标枪骑兵
600 黑暗时代制图学 (T) (葡)
601 标枪骑兵 (激活)
602 纵火
603 攻城塔 (激活)
604 火艨艟 (激活)
605 爆破筏 (激活)
606 标枪骑兵 (禁用)
607 弓兵开火快+15% (埃塞)
608 射箭槽
609 化学 + 扭绞机
610 射箭槽 (警戒箭塔)
611 射箭槽 (大型箭塔)
612 喷火船自带弹道学
613 马厩单位花费 -20%, 帝王时代 (柏)
614 重弩战象 (激活) (高棉)
615 精锐重弩战象 (高棉)
616 爪刀勇士 (激活) (马来)
617 精锐爪刀勇士 (马来)
618 飞镖骑兵 (激活) (缅)
619 精锐飞镖骑兵 (缅)
620 藤甲弓兵 (激活) (越)
621 精锐藤甲弓兵 (越)
622 獠牙剑 (高棉)
623 双箭弩 (高棉)
624 海上霸主 (马来)
625 强征兵役 (马来)
626 象轿 (缅)
627 曼尼普尔马 (缅)
628 宝伞 (越)
629 纸币 (越)
630 象兵 (激活)
631 精锐象兵
632 弓兵 HP +10% (越)
633 步兵 +1 攻击, 黑暗时代 (缅)
634 时代升级加快 (马来)
635 渔网成本 -33% (马来)
636 <636>
637 无限渔获 (马来)
638 Khmer requirement
639 Town Center Spawn
640 Disable TC spawn
641 帝王时代 + 游牧
642 <642>
643 <643>
644 <644>
645 伐木科技免费升级 (缅)
646 步兵 +1 攻击, 封建时代 (缅)
647 步兵 +1 攻击, 城堡时代 (缅)
648 步兵 +1 攻击, 帝王时代 (缅)
649 修道院科技成本 -50% (缅)
650 Civ: 高棉 (高棉)
651 Civ: 马来 (马来)
652 Civ: 缅甸 (缅)
653 Civ: 越南 (越)
654 <654>
655 帝王掷矛手
656 帝王掷矛手 (禁用)
657 村民可以进驻房屋 (高棉)
658 设为最大人口 (免房屋)
659 Shadow Node+ for Age Two
660 Shadow Node+ for Age Three
661 Shadow Node+ for Age Four
662 象兵价格降低 (马来)
663 弓兵 HP +15% (越)
664 弓兵 HP +20% (越)
665 越南视野 (越)
666 Shadow Node Mill + Khmer
667 Shadow Node Barracks + Khmer
668 Shadow Node Blacksmith + Khmer
669 海上霸主 + 箭羽
670 海上霸主 + 锥子箭
671 海上霸主 + 护腕
672 象兵 +15% 移动速度 (高棉)
673 Civ: 保加利亚 (保)
674 Civ: 鞑靼 (鞑)
675 Civ: 库曼 (库)
676 Civ: 立陶宛 (立)
677 龙骑兵 (激活)(保)
678 精锐龙骑兵 (保)
679 怯薛 (激活)(鞑)
680 精锐怯薛 (鞑)
681 钦察骑射手 (激活)(库)
682 精锐钦察骑射手 (库)
683 皇家骑士 (激活)(立)
684 精锐皇家骑士 (立)
685 马镫 (保)
686 屯长 (保)
687 丝护甲 (鞑)
688 帖木儿攻城术 (鞑)
689 大草原畜牧 (库)
690 库曼雇佣兵 (库)
691 山寨 (立)
692 塔盾 (立)
693 免费民兵系升级 (保)
694 城镇中心花费 -50% 石料 (保)
695 启用营垒 (保)
696 高地奖励 (鞑)
697 +150 食物, 黑暗时代 (立)
698 免费帕提亚战术 (鞑)
699 圣物 +1 骑兵攻击 1 (立)
700 圣物 +1 骑兵攻击 2 (立)
701 圣物 +1 骑兵攻击 3 (立)
702 圣物 +1 骑兵攻击 4 (立)
703 <703>
704 牲畜 +50% 食物 (鞑)
705 攻城武器厂 (激活)(库)
706 冲车升级, 城堡时代 (库)
707 雇佣库曼骑射手 (激活)
708 雇佣库曼骑射手 (禁用)
709 额外城镇中心, 封建时代 (库)
710 掷矛手系、长枪兵系 +10% 移动速度 (立)
711 骑兵 +5% 移动速度, 封建时代 (库)
712 冲车升级
713 单位重命名
714 草原突骑 (激活)
715 精锐草原突骑
716 供给
717 完整科技下移动草原突骑生产按钮
718 完整科技下移动马厩答剌罕骑兵生产按钮
719 完整科技下移动兵营近卫军生产按钮
720 完整科技下移动投石手生产按钮
721 斯拉夫组队奖励 (斯)
722 阴影 TC, 黑暗时代
723 改变 TC 建造时间 1 (库)
724 改变 TC 建造时间 2 (库)
725 弓兵对建筑攻击, 城堡时代 (萨)
726 弓兵对建筑攻击, 帝王时代 (萨)
727 骑兵 +5% 移动速度, 城堡时代 (库)
728 骑兵 +5% 移动速度, 帝王时代 (库)
729 纪念碑资源
730 起始羊驼 (印加)
'''

list = raw.strip().split("\n")

for item in list:
    id = int(item.split(" ")[0])
    name = item.split(" ")[1:]
    print(id, hex(id).upper()[2:], " ".join(name))